package com.github.olegschwann.spritzreader.spritz_reader;

import com.google.gson.Gson;

import java.util.NoSuchElementException;

public class WordProvider {
    private Word[][] letter;
    private int currentSentence;
    private int currentWord;

    WordProvider() {
        String testData = "[[{\"l\":\"Надв\",\"c\":\"о\",\"r\":\"рный\"},{\"l\":\"сов\",\"c\":\"е\",\"r\":\"тник\"},{\"l\":\"Сем\",\"c\":\"е\",\"r\":\"н\"},{\"l\":\"Петр\",\"c\":\"о\",\"r\":\"вич\"},{\"l\":\"Подт\",\"c\":\"ы\",\"r\":\"кин\"},{\"l\":\"с\",\"c\":\"е\",\"r\":\"л\"},{\"l\":\"з\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"ст\",\"c\":\"о\",\"r\":\"л,\"},{\"l\":\"покр\",\"c\":\"ы\",\"r\":\"л\"},{\"l\":\"сво\",\"c\":\"ю\",\"r\":\"\"},{\"l\":\"гр\",\"c\":\"у\",\"r\":\"дь\"},{\"l\":\"салф\",\"c\":\"е\",\"r\":\"ткой\"},{\"l\":\"\",\"c\":\"и\",\"r\":\",\"},{\"l\":\"сгор\",\"c\":\"а\",\"r\":\"я\"},{\"l\":\"нетерп\",\"c\":\"е\",\"r\":\"нием,\"},{\"l\":\"ст\",\"c\":\"а\",\"r\":\"л\"},{\"l\":\"ожид\",\"c\":\"а\",\"r\":\"ть\"},{\"l\":\"тог\",\"c\":\"о\",\"r\":\"\"},{\"l\":\"мом\",\"c\":\"е\",\"r\":\"нта,\"},{\"l\":\"когд\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"начн\",\"c\":\"у\",\"r\":\"т\"},{\"l\":\"подав\",\"c\":\"а\",\"r\":\"ть\"},{\"l\":\"блин\",\"c\":\"ы\",\"r\":\"...\"}],[{\"l\":\"П\",\"c\":\"е\",\"r\":\"ред\"},{\"l\":\"н\",\"c\":\"и\",\"r\":\"м,\"},{\"l\":\"к\",\"c\":\"а\",\"r\":\"к\"},{\"l\":\"п\",\"c\":\"е\",\"r\":\"ред\"},{\"l\":\"полков\",\"c\":\"о\",\"r\":\"дцем,\"},{\"l\":\"осм\",\"c\":\"а\",\"r\":\"тривающим\"},{\"l\":\"п\",\"c\":\"о\",\"r\":\"ле\"},{\"l\":\"б\",\"c\":\"и\",\"r\":\"твы,\"},{\"l\":\"расстил\",\"c\":\"а\",\"r\":\"лась\"},{\"l\":\"ц\",\"c\":\"е\",\"r\":\"лая\"},{\"l\":\"карт\",\"c\":\"и\",\"r\":\"на...\"}],[{\"l\":\"Посред\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"стол\",\"c\":\"а\",\"r\":\",\"},{\"l\":\"в\",\"c\":\"ы\",\"r\":\"тянувшись\"},{\"l\":\"в\",\"c\":\"о\",\"r\":\"\"},{\"l\":\"фр\",\"c\":\"о\",\"r\":\"нт,\"},{\"l\":\"сто\",\"c\":\"я\",\"r\":\"ли\"},{\"l\":\"стр\",\"c\":\"о\",\"r\":\"йные\"},{\"l\":\"бут\",\"c\":\"ы\",\"r\":\"лки.\"}],[{\"l\":\"Т\",\"c\":\"у\",\"r\":\"т\"},{\"l\":\"б\",\"c\":\"ы\",\"r\":\"ли\"},{\"l\":\"тр\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"сорт\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"в\",\"c\":\"о\",\"r\":\"док,\"},{\"l\":\"к\",\"c\":\"и\",\"r\":\"евская\"},{\"l\":\"нал\",\"c\":\"и\",\"r\":\"вка,\"},{\"l\":\"шатолар\",\"c\":\"о\",\"r\":\"з,\"},{\"l\":\"рейнв\",\"c\":\"е\",\"r\":\"йн\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"д\",\"c\":\"а\",\"r\":\"же\"},{\"l\":\"пуз\",\"c\":\"а\",\"r\":\"тый\"},{\"l\":\"сос\",\"c\":\"у\",\"r\":\"д\"},{\"l\":\"\",\"c\":\"с\",\"r\":\"\"},{\"l\":\"произвед\",\"c\":\"е\",\"r\":\"нием\"},{\"l\":\"отц\",\"c\":\"о\",\"r\":\"в\"},{\"l\":\"бенед\",\"c\":\"и\",\"r\":\"ктинцев.\"}],[{\"l\":\"Вокр\",\"c\":\"у\",\"r\":\"г\"},{\"l\":\"нап\",\"c\":\"и\",\"r\":\"тков\"},{\"l\":\"\",\"c\":\"в\",\"r\":\"\"},{\"l\":\"худ\",\"c\":\"о\",\"r\":\"жественном\"},{\"l\":\"беспор\",\"c\":\"я\",\"r\":\"дке\"},{\"l\":\"тесн\",\"c\":\"и\",\"r\":\"лись\"},{\"l\":\"с\",\"c\":\"е\",\"r\":\"льди\"},{\"l\":\"\",\"c\":\"с\",\"r\":\"\"},{\"l\":\"горч\",\"c\":\"и\",\"r\":\"чным\"},{\"l\":\"с\",\"c\":\"о\",\"r\":\"усом,\"},{\"l\":\"к\",\"c\":\"и\",\"r\":\"льки,\"},{\"l\":\"смет\",\"c\":\"а\",\"r\":\"на,\"},{\"l\":\"зерн\",\"c\":\"и\",\"r\":\"стая\"},{\"l\":\"икр\",\"c\":\"а\",\"r\":\",\"},{\"l\":\"св\",\"c\":\"е\",\"r\":\"жая\"},{\"l\":\"с\",\"c\":\"ё\",\"r\":\"мга.\"}],[{\"l\":\"Подт\",\"c\":\"ы\",\"r\":\"кин\"},{\"l\":\"гляд\",\"c\":\"е\",\"r\":\"л\"},{\"l\":\"н\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"вс\",\"c\":\"ё\",\"r\":\"\"},{\"l\":\"\",\"c\":\"э\",\"r\":\"то\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"ж\",\"c\":\"а\",\"r\":\"дно\"},{\"l\":\"глот\",\"c\":\"а\",\"r\":\"л\"},{\"l\":\"сл\",\"c\":\"ю\",\"r\":\"нки...\"}],[{\"l\":\"Глаз\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"ег\",\"c\":\"о\",\"r\":\"\"},{\"l\":\"под\",\"c\":\"е\",\"r\":\"рнулись\"},{\"l\":\"м\",\"c\":\"а\",\"r\":\"слом,\"},{\"l\":\"лиц\",\"c\":\"о\",\"r\":\"\"},{\"l\":\"покрив\",\"c\":\"и\",\"r\":\"ло\"},{\"l\":\"сладостр\",\"c\":\"а\",\"r\":\"стьем...\"}],[{\"l\":\"'Н\",\"c\":\"у\",\"r\":\",\"},{\"l\":\"м\",\"c\":\"о\",\"r\":\"жно\"},{\"l\":\"л\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"т\",\"c\":\"а\",\"r\":\"к\"},{\"l\":\"д\",\"c\":\"о\",\"r\":\"лго?'-\"},{\"l\":\"пом\",\"c\":\"о\",\"r\":\"рщился\"},{\"l\":\"\",\"c\":\"о\",\"r\":\"н,\"},{\"l\":\"обращ\",\"c\":\"а\",\"r\":\"ясь\"},{\"l\":\"\",\"c\":\"к\",\"r\":\"\"},{\"l\":\"жен\",\"c\":\"е\",\"r\":\".\"}],[{\"l\":\"Након\",\"c\":\"е\",\"r\":\"ц,\"},{\"l\":\"показ\",\"c\":\"а\",\"r\":\"лась\"},{\"l\":\"кух\",\"c\":\"а\",\"r\":\"рка\"},{\"l\":\"\",\"c\":\"с\",\"r\":\"\"},{\"l\":\"блин\",\"c\":\"а\",\"r\":\"ми...\"}],[{\"l\":\"Сем\",\"c\":\"ё\",\"r\":\"н\"},{\"l\":\"Петр\",\"c\":\"о\",\"r\":\"вич,\"},{\"l\":\"риск\",\"c\":\"у\",\"r\":\"я\"},{\"l\":\"ож\",\"c\":\"е\",\"r\":\"чь\"},{\"l\":\"п\",\"c\":\"а\",\"r\":\"льцы,\"},{\"l\":\"схват\",\"c\":\"и\",\"r\":\"л\"},{\"l\":\"дв\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"в\",\"c\":\"е\",\"r\":\"рхних,\"},{\"l\":\"с\",\"c\":\"а\",\"r\":\"мых\"},{\"l\":\"гор\",\"c\":\"я\",\"r\":\"чих\"},{\"l\":\"блин\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"аппет\",\"c\":\"и\",\"r\":\"тно\"},{\"l\":\"шл\",\"c\":\"ё\",\"r\":\"пнул\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"х\"},{\"l\":\"н\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"сво\",\"c\":\"ю\",\"r\":\"\"},{\"l\":\"тар\",\"c\":\"е\",\"r\":\"лку.\"}],[{\"l\":\"Блин\",\"c\":\"ы\",\"r\":\"\"},{\"l\":\"б\",\"c\":\"ы\",\"r\":\"ли\"},{\"l\":\"подж\",\"c\":\"а\",\"r\":\"ристые,\"},{\"l\":\"п\",\"c\":\"о\",\"r\":\"ристые,\"},{\"l\":\"п\",\"c\":\"у\",\"r\":\"хлые,\"},{\"l\":\"к\",\"c\":\"а\",\"r\":\"к\"},{\"l\":\"плеч\",\"c\":\"о\",\"r\":\"\"},{\"l\":\"куп\",\"c\":\"е\",\"r\":\"ческой\"},{\"l\":\"д\",\"c\":\"о\",\"r\":\"чки...\"}],[{\"l\":\"Подт\",\"c\":\"ы\",\"r\":\"кин\"},{\"l\":\"при\",\"c\":\"я\",\"r\":\"тно\"},{\"l\":\"улыбн\",\"c\":\"у\",\"r\":\"лся,\"},{\"l\":\"икн\",\"c\":\"у\",\"r\":\"л\"},{\"l\":\"\",\"c\":\"о\",\"r\":\"т\"},{\"l\":\"вост\",\"c\":\"о\",\"r\":\"рга\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"обл\",\"c\":\"и\",\"r\":\"л\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"х\"},{\"l\":\"гор\",\"c\":\"я\",\"r\":\"чим\"},{\"l\":\"м\",\"c\":\"а\",\"r\":\"слом.\"}],[{\"l\":\"Зас\",\"c\":\"и\",\"r\":\"м,\"},{\"l\":\"к\",\"c\":\"а\",\"r\":\"к\"},{\"l\":\"б\",\"c\":\"ы\",\"r\":\"\"},{\"l\":\"разжиг\",\"c\":\"а\",\"r\":\"я\"},{\"l\":\"св\",\"c\":\"о\",\"r\":\"й\"},{\"l\":\"аппет\",\"c\":\"и\",\"r\":\"т\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"наслажд\",\"c\":\"а\",\"r\":\"ясь\"},{\"l\":\"предвкуш\",\"c\":\"е\",\"r\":\"нием,\"},{\"l\":\"\",\"c\":\"о\",\"r\":\"н\"},{\"l\":\"м\",\"c\":\"е\",\"r\":\"дленно,\"},{\"l\":\"\",\"c\":\"с\",\"r\":\"\"},{\"l\":\"расстан\",\"c\":\"о\",\"r\":\"вкой\"},{\"l\":\"обм\",\"c\":\"а\",\"r\":\"зал\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"х\"},{\"l\":\"икр\",\"c\":\"о\",\"r\":\"й.\"}],[{\"l\":\"Мест\",\"c\":\"а\",\"r\":\",\"},{\"l\":\"н\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"кот\",\"c\":\"о\",\"r\":\"рые\"},{\"l\":\"н\",\"c\":\"е\",\"r\":\"\"},{\"l\":\"поп\",\"c\":\"а\",\"r\":\"ла\"},{\"l\":\"икр\",\"c\":\"а\",\"r\":\",\"},{\"l\":\"\",\"c\":\"о\",\"r\":\"н\"},{\"l\":\"обл\",\"c\":\"и\",\"r\":\"л\"},{\"l\":\"смет\",\"c\":\"а\",\"r\":\"ной...\"}],[{\"l\":\"Остав\",\"c\":\"а\",\"r\":\"лось\"},{\"l\":\"теп\",\"c\":\"е\",\"r\":\"рь\"},{\"l\":\"т\",\"c\":\"о\",\"r\":\"лько\"},{\"l\":\"\",\"c\":\"е\",\"r\":\"сть,\"},{\"l\":\"н\",\"c\":\"е\",\"r\":\"\"},{\"l\":\"пр\",\"c\":\"а\",\"r\":\"вда\"},{\"l\":\"л\",\"c\":\"и\",\"r\":\"?\"}],[{\"l\":\"Н\",\"c\":\"о\",\"r\":\"\"},{\"l\":\"н\",\"c\":\"е\",\"r\":\"т!..\"}],[{\"l\":\"Подт\",\"c\":\"ы\",\"r\":\"кин\"},{\"l\":\"взглян\",\"c\":\"у\",\"r\":\"л\"},{\"l\":\"н\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"дел\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"р\",\"c\":\"у\",\"r\":\"к\"},{\"l\":\"сво\",\"c\":\"и\",\"r\":\"х\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"н\",\"c\":\"е\",\"r\":\"\"},{\"l\":\"удовлетвор\",\"c\":\"и\",\"r\":\"лся...\"}],[{\"l\":\"Под\",\"c\":\"у\",\"r\":\"мав\"},{\"l\":\"немн\",\"c\":\"о\",\"r\":\"го,\"},{\"l\":\"\",\"c\":\"о\",\"r\":\"н\"},{\"l\":\"полож\",\"c\":\"и\",\"r\":\"л\"},{\"l\":\"н\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"блин\",\"c\":\"ы\",\"r\":\"\"},{\"l\":\"с\",\"c\":\"а\",\"r\":\"мый\"},{\"l\":\"ж\",\"c\":\"и\",\"r\":\"рный\"},{\"l\":\"кус\",\"c\":\"о\",\"r\":\"к\"},{\"l\":\"с\",\"c\":\"ё\",\"r\":\"мги,\"},{\"l\":\"к\",\"c\":\"и\",\"r\":\"льку\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"сард\",\"c\":\"и\",\"r\":\"нку,\"},{\"l\":\"пот\",\"c\":\"о\",\"r\":\"м\"},{\"l\":\"\",\"c\":\"у\",\"r\":\"ж,\"},{\"l\":\"мл\",\"c\":\"е\",\"r\":\"я\"},{\"l\":\"\",\"c\":\"и\",\"r\":\"\"},{\"l\":\"задых\",\"c\":\"а\",\"r\":\"ясь,\"},{\"l\":\"сверн\",\"c\":\"у\",\"r\":\"л\"},{\"l\":\"\",\"c\":\"о\",\"r\":\"ба\"},{\"l\":\"блин\",\"c\":\"а\",\"r\":\"\"},{\"l\":\"\",\"c\":\"в\",\"r\":\"\"},{\"l\":\"тр\",\"c\":\"у\",\"r\":\"бку,\"},{\"l\":\"\",\"c\":\"с\",\"r\":\"\"},{\"l\":\"ч\",\"c\":\"у\",\"r\":\"вством\"},{\"l\":\"в\",\"c\":\"ы\",\"r\":\"пил\"},{\"l\":\"р\",\"c\":\"ю\",\"r\":\"мку\"},{\"l\":\"в\",\"c\":\"о\",\"r\":\"дки,\"},{\"l\":\"кр\",\"c\":\"я\",\"r\":\"кнул,\"},{\"l\":\"раскр\",\"c\":\"ы\",\"r\":\"л\"},{\"l\":\"р\",\"c\":\"о\",\"r\":\"т...\"}],[{\"l\":\"Н\",\"c\":\"о\",\"r\":\"\"},{\"l\":\"т\",\"c\":\"у\",\"r\":\"т\"},{\"l\":\"ег\",\"c\":\"о\",\"r\":\"\"},{\"l\":\"хват\",\"c\":\"и\",\"r\":\"л\"},{\"l\":\"инс\",\"c\":\"у\",\"r\":\"льт.\"}]]";
        Gson gson = new Gson();
        this.letter = gson.fromJson(testData, Word[][].class);
        this.currentWord = 0;
        this.currentSentence = 0;
    }

    class NoSuchWordException extends NoSuchElementException{
        public Word lastExistingWord;

        NoSuchWordException(Word w){
            this.lastExistingWord = w;
        }
    }


    // Получить следующее слово, продвинуться на 1.
    public Word next() throws NoSuchWordException {
        if (this.currentSentence >= this.letter.length) {
            int lastSentence = this.letter.length - 1;
            int lastWorlds = this.letter[lastSentence].length-1;
            throw new NoSuchWordException(this.letter[lastSentence][lastWorlds]);
        }

        Word word = this.letter[this.currentSentence][this.currentWord];

        this.currentWord += 1;
        if (this.currentWord >= this.letter[this.currentSentence].length) {
            this.currentWord = 0;
            this.currentSentence += 1;
        }

        return word;
    }

    // Перейти к началу предыдущего предложения
    // Или к началу текущего, если мы находимся в первом предложении.
    public void toPreviousSentence() {
        if (this.currentSentence != 0) {
            this.currentSentence -= 1;
        }
        this.currentWord = 0;
    }

    // Перейти к первому слову следующего предложения, или
    // сохранить бросание NoSuchElementException на каждый вызов Next
    public void toNextSentence() {
        if (this.currentSentence != this.letter.length) {
            this.currentSentence += 1;
        }
        this.currentWord = 0;
    }

    // Установить номер предложения, с которого будет начато воспроизведение.
    public void setSentenceNumber(int number) {
        this.currentSentence = number;
        this.currentWord = 0;
    }

    // установить письмо.
    // set the letter number
}
